export const CHAT_INFO = [
  "🔹 برای چت می‌تونی یکی از راه‌های زیر رو انتخاب کنی:",
  "⚜️ جستجوی تصادفی رو از بخش شروع چت انتخاب کنی و به صورت تصادفی به یکی وصل بشی! (بدون نیاز به سکه)",
  "⚜️ جستجو بر اساس جنسیت مورد نظر رو از بخش شروع چت انتخاب کنی و به یکی وصل بشی (نیاز به 2 سکه)",
].join("\n");

export const PROFILE_INFO = [
  "🔹 پروفایل چیست؟",
  "⚜️ برای دیدن پروفایل خودت کافیه «👤 پروفایل» رو لمس کنی.",
  "- پروفایل هر کاربر شامل اطلاعاتی که تو ربات ثبت کرده (نام، سن، جنسیت، شهر، عکس) و تاریخ حضورش تو ربات و فاصله‌اش با شماست.",
  "⚜️ با تکمیل پروفایل 10 سکه دریافت می‌کنی.",
].join("\n");

export const COINS_INFO = [
  "🔹 سکه یا امتیاز چیست؟",
  "",
  "شما با داشتن سکه می‌توانید:",
  "",
  "- پیام دایرکت بفرستید (1 سکه)",
  "- درخواست چت بفرستید (2 سکه)",
  "- از جستجوی پسر یا جستجوی دختر استفاده کنید (2 سکه)",
  "- از «به محض آنلاین شدن اطلاع بده» استفاده کنید (1 سکه)",
  "- از «به محض اتمام چت به من اطلاع بده» استفاده کنید (1 سکه)",
  "- ثبت بیوگرافی جدید (1 سکه)",
  "",
  "📢 توجه: سکه فقط در صورتی کسر می‌شود که درخواست موفق باشد (مثلاً درخواست چت شما توسط کاربر مقابل پذیرفته شود)",
  "",
  "❓ روش به دست آوردن سکه چیست؟",
  "",
  "1️⃣ معرفی دوستان (رایگان):",
  "برای افزایش سکه به صورت رایگان بنر لینک ⚡️ مخصوص خودت (/link) رو برای دوستات بفرست و 20 سکه دریافت کن",
  "<blockquote>به ازای هر نفری که با لینک ⚡️ شما وارد ربات میشه به محض ورود 5 تا سکه رایگان دریافت می‌کنی و بعد از اینکه اطلاعات پروفایلش رو کامل کرد 15 تا سکه دیگه هم دریافت می‌کنی! 😎 (5+15=20)</blockquote>",
  "",
  "2️⃣ خرید سکه به صورت آنلاین",
  "",
  "3️⃣ گزارش کاربران متخلف:",
  "با معرفی کردن افرادی که قوانین ربات رو رعایت نمی‌کنند 5 سکه هدیه بگیر 😍",
  "",
  "⚠️ 5 سکه بابت گزارش تخلف پس از بررسی گزارش و صحیح بودن آن اضافه خواهد شد و گزارش تخلف حتماً باید توضیحات داشته باشد.",
  "",
  "💡 برای گزارش تخلف کاربر گزینه‌ی «🚫 گزارش کاربر» رو روی پروفایلش لمس کن.",
  "",
  "🔸 راهنما: /help",
].join("\n");

// برای وقتی که جستجوی GPS ساخته شد
export const NEARBY_INFO = [
  "🔹 چگونه افراد نزدیکمو پیدا کنم؟",
  "",
  "برای دیدن لیست افراد نزدیکت فقط کافیه «📍 پیدا کردن افراد نزدیک با GPS» رو لمس کنی.",
  "<blockquote>جستجوی افراد نزدیک کاملاً رایگان هست (بدون نیاز به سکه)</blockquote>",
  "",
  "برای مشاهده کردن و یا چت کردن با افراد نزدیکت کافیه توی لیست روی آیدی‌شون بزنی تا پروفایلشونو ببینی.",
  "",
  "📢 توجه: امکان مشاهده موقعیت کاربران وجود ندارد و فقط فاصله‌ی آن‌ها نمایش داده می‌شود.",
].join("\n");